# Understandin Mean , Median and Mode

 <br><br>
> # Mean
It’s the sum of all values divided by the total number of values.

Mean= ∑x / i

Example:
Numbers = [2, 4, 6, 8, 10]
Mean = (2 + 4 + 6 + 8 + 10) / 5 = 6

> mean is sensitive to outliers (a very high or low number can change it a lot).

In [14]:
import pandas as pd
import numpy as np

df = pd.read_csv("Practice.csv")
df

        Name       Income
0      Abish      10000.0
1       Saim      15000.0
2     Haider      20000.0
3      Fahad          NaN
4       Sana      30000.0
5       Eman      35000.0
6  Elon Musk  100000000.0

In [15]:
print(df)
print()
print(f"Average is : {df.Income.mean()}")

        Name       Income
0      Abish      10000.0
1       Saim      15000.0
2     Haider      20000.0
3      Fahad          NaN
4       Sana      30000.0
5       Eman      35000.0
6  Elon Musk  100000000.0

Average is : 16685000.0

In [19]:
new_df = df.fillna(df.Income.mean())
new_df

        Name       Income
0      Abish      10000.0
1       Saim      15000.0
2     Haider      20000.0
3      Fahad   16685000.0
4       Sana      30000.0
5       Eman      35000.0
6  Elon Musk  100000000.0

<br><br>
># Median

he middle value when data is sorted in order.


* Arrange data in order.

* If count is odd → middle value.

* If count is even → average of two middle values.

Example:
[2, 4, 6, 8, 10] → Median = 6
[2, 4, 6, 8] → Median = (4 + 6) / 2 = 5

> Median is not affected by outliers. As in mean due to one outlier / or large value we got a wrong average

In [18]:
new_df = df.fillna(df.Income.median())
new_df

        Name       Income
0      Abish      10000.0
1       Saim      15000.0
2     Haider      20000.0
3      Fahad      25000.0
4       Sana      30000.0
5       Eman      35000.0
6  Elon Musk  100000000.0

<br><br>
> # Mode
The most frequent value in the dataset.

Example:
[2, 4, 4, 6, 8] → Mode = 4

 Mode is useful for categorical data (e.g., most common color, product, etc.)